<template>
  <BaseFeatures :features="features">
    <template #title>Особоенности нашей методики обучения</template>
  </BaseFeatures>
</template>
<script>
export default {
  data: () => ({
    features: [
      {
        title: 'Языковое погружение',
        text:
          'Занятия проходят полностью на английском языке, независимо от типа задания',
      },
      {
        title: 'Развитие 10 видов интеллекта',
        text:
          'Учимся общаться, развивать эмоциональный, творческий интеллект и многое другое',
      },
      {
        title: 'Небольшие группы',
        text:
          'Дети занимаются в группах до 5 человек, что позволяет применять индивидуальный подход к каждому',
      },
      {
        title: 'Педагоги — носители языка',
        text:
          'Занятия ведут преподаватели из США, Великобритании и Канады, для которых английский язык является родным',
      },
    ],
  }),
}
</script>
